zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_pwr_ex.c
  * @author  MCD Application Team
  * @brief   Extended PWR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of PWR extension peripheral:
  *           + Peripheral Extended features functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup PWREx PWREx
  * @brief PWR HAL module driver
  * @{
  */

#ifdef HAL_PWR_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/** @addtogroup PWREx_Private_Types PWREx Private Types
  * @{
  */
#if defined(CORE_CM33)||defined(CORE_CA35)
typedef struct
{
  uint32_t active;
  uint32_t ready;
  uint32_t monitor;
  uint32_t low;
  uint32_t lowStandby;
} pvmPosTypeDef;
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @addtogroup PWREx_Private_Constants PWREx Private Constants
  * @{
  */


/** @defgroup PWREx_FLAG_REG_SET_TIMEOUT PWR Extended Flag Setting Time Out Value
  * @{
  */
#define PWREx_FLAG_SETTING_DELAY_US  ((uint32_t)1000U)
/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup PWREx_Private_Functions PWREx Private Functions
  * @{
  */
#if defined(CORE_CM33)||defined(CORE_CA35)
void pvmPosition(uint32_t periph, __IO uint32_t **regPtr, pvmPosTypeDef *pvmPos);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
/** @defgroup PWREx_Group1 Peripheral Extended features functions
  *  @brief Peripheral Extended features functions
  *
@verbatim

 ===============================================================================
                 ##### Peripheral extended features functions #####
 ===============================================================================

    *** Regulators configuration ***
    ================================================
    [..]
      (+) The backup domain includes 4 Kbytes of backup SRAM accessible only from
          the CPU, and address in 32-bit, 16-bit or 8-bit mode. Its content is
          retained even in Standby or VBAT mode when the low power backup regulator
          is enabled. It can be considered as an internal EEPROM when VBAT is
          always present. You can use the HAL_PWREx_EnableBkUpReg() function to
          enable the low power backup regulator.

      (+) When the backup domain is supplied by VDD (analog switch connected to VDD)
          the backup SRAM is powered from VDD which replaces the VBAT power supply to
          save battery life.

      (+) The backup SRAM is not mass erased by a tamper event. It is read
          protected to prevent confidential data, such as cryptographic private
          key, from being accessed.

      (+) Additionally 128 kbytes (32-bit, 16-bit or 8-bit accessible ) of retention ram is available, its content is
          retained even in Standby or VBAT mode when the low power retention ram regulator
          is enabled (HAL_PWREx_EnableRetRam)

      (+) Additionally 8 kbytes (32-bit, 16-bit or 8-bit accessible ) of Lpsram1 is available,
          its content is retained even in Standby or VBAT mode when the low power Lpsram1 ram regulator
          is enabled (HAL_PWR_EnableCpu3LpsramReg)

        Refer to the product datasheets for more details.

     *** VBAT and Temperature supervision ***
    ========================================
    [..]
      (+) The VBAT battery voltage supply can be monitored by comparing it with two threshold
          levels: VBAThigh and VBATlow. VBATH flag and VBATL flags in the PWR control register 2
          (PWR_CR2), indicate if VBAT is higher or lower than the threshold.
      (+) The temperature can be monitored by comparing it with two threshold levels, TEMPhigh
          and TEMPlow. TEMPH and TEMPL flags, in the PWR control register 2 (PWR_CR2),
          indicate whether the device temperature is higher or lower than the threshold.
      (+) The VBAT and the temperature monitoring is enabled by HAL_PWREx_EnableVbatTempMonitoring()
          function and disabled by HAL_PWREx_DisableVbatTempMonitoring() function.
      (+) The HAL_PWREx_GetVbatLevel() function return the VBAT level which can be:
          PWR_VBAT_BELOW_LOW_THRESHOLD or PWR_VBAT_ABOVE_HIGH_THRESHOLD or
          PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD.
      (+) The HAL_PWREx_GetTemperatureLevel() function return the Temperature level which
          can be: PWR_TEMP_BELOW_LOW_THRESHOLD or PWR_TEMP_ABOVE_HIGH_THRESHOLD or
          PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD.

    *** PVM configuration ***
    =========================
    [..]
      (+) The PVM is used to monitor  power supply of peripheral by comparing it to a
          fix threshold (PVM threshold is  equal 1.6 V and cannot be modified)
      (+) A GPVMO flag is available to indicate when a periph voltage lower
          than the PVM threshold. This event is internally connected to the EXTI
          line to generate an interrupt if enabled.
          It is configurable through __HAL_PWR_PVM_EXTI_ENABLE_IT() macro.
      (+) The PVM is stopped in System Standby mode.


    *** USB Regulator supervision ***
    ===================================
    [..]
      (+) When the USB regulator is enabled, the VDD33USB supply level detector shall
          be enabled through  HAL_PWREx_EnableUSBVoltageDetector() function and disabled by
          HAL_PWREx_DisableUSBVoltageDetector() function.

@endverbatim
  * @{
  */


/**
  * @brief  Enables backup ram content retention when system is in standby or Vbat mode
  *         This feature is implemented  thru  usage of backup Regulator for backup ram supply in standby/Vbat
  * @note   After reset PWR_CR2/PWR_CR9/PWR_CR10 registers are write-protected,
  * @note   see HAL_PWR_EnableBkUpD3Access/HAL_PWR_DisableBkUpD3Access.
  * @note   As this function accesses  to one of these registers, user shall check write protection is removed
  * @note   before calling this function
  * @note   (e.g. call to HAL_PWR_EnableBkUpD3Access during start of user application)
  * @retval void
  */
void HAL_PWREx_EnableBkUpRamContentStandbyRetention(void)
{
  SET_BIT(PWR->CR9, PWR_CR9_BKPRBSEN);
}

/**
  * @brief  @brief  Disables backup ram content retention when system is in standby and Vbat mode
  * @note   As this function accesses  to one of these registers, user shall check write protection is removed
  * @note   before calling this function
  * @note   (e.g. call to HAL_PWR_EnableBkUpD3Access during start of user application)
  * @retval void
  */
void HAL_PWREx_DisableBkUpRamContentStandbyRetention(void)
{
  CLEAR_BIT(PWR->CR9, PWR_CR9_BKPRBSEN);
}

/**
  * @brief  Enables retention ram content retention when system is in standby and/or Vbat mode (see param)
  *         This feature is implemented  thru  usage of backup Regulator for retention ram supply in standby/Vbat
  * @param  RetentionRamPowerSupplyMode: Specifies mode where retention RAM is powered thru backup regulator.
  *          This parameter can be one of the following values:
  *            @arg PWR_RETENTION_RAM_SUPPLY_ON_STDBYONLY i.e. powering with backup regulator in STANDBY mode only
  *            @arg PWR_RETENTION_RAM_SUPPLY_ON_STDBY_VBAT i.e. powering with backup regulator in STANDBY and VBAT mode
  * @note   As this function access to one of this register, user shall check write protection is removed
  * @note   ( e.g. call to HAL_PWR_EnableBkUpD3Access at start of user application)
  * @retval void
  */
void HAL_PWREx_EnableRetRamContentStandbyRetention(uint32_t RetentionRamPowerSupplyMode)
{
  assert_param(IS_PWR_RETENTION_RAM_SUPPLY((uint32_t)RetentionRamPowerSupplyMode));
  MODIFY_REG(PWR->CR10, PWR_CR10_RETRBSEN_Msk, (uint32_t)RetentionRamPowerSupplyMode);
}

/**
  * @brief  Disables retention ram content retention  when system is in standby  or vbat
  * @note   As this function access to one of this register, user shall check write protection is removed
  * @note   (e.g. call to HAL_PWR_EnableBkUpD3Access at start of user application)
  * @retval void
  */
void HAL_PWREx_DisableRetRamContentStandbyRetention(void)
{
  MODIFY_REG(PWR->CR10, PWR_CR10_RETRBSEN_Msk, PWR_RETENTION_RAM_SUPPLY_OFF);
}
#if defined(PWR_CR9_LPR1BSEN)
/**
  * @brief  Enables lpsram1 content retention when system is in standby2 and Vbat mode
  *         This feature is implemented  thru  usage of backup Regulator for lpsram ram supply in standby/Vbat
  * @note   when system is in standby1, M0P can R/W lpsram1 whatever this function is called or not.
  * @note   As this function access to one of this register, user shall check write protection is removed
  * @note   (e.g. call to HAL_PWR_EnableBkUpD3Access at start of user application)
  * @retval void
  */
void HAL_PWREx_EnableLpsram1ContentStandby2Retention(void)
{
  SET_BIT(PWR->CR9, PWR_CR9_LPR1BSEN);
}

/**
  * @brief  Disables lpsram1 content retention when system is in standby2 and Vbat mode
  * @note   As this function access to one of this register, user shall check write protection is removed
  * @note   (e.g. call to HAL_PWR_EnableBkUpD3Access at start of user application)
  * @retval void
  */
void HAL_PWREx_DisableLpsram1ContentStandby2Retention(void)
{
  CLEAR_BIT(PWR->CR9, PWR_CR9_LPR1BSEN);
}
#endif /* defined(PWR_CR9_LPR1BSEN) */

#if defined(PWR_CR12_VDDGPURDY)
#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief  Valid GPU supply.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PWREx_EnableGPUSupply(void)
{
  uint32_t tickstart;
  uint32_t maskEn;
  uint32_t maskRdy;

  maskEn = PWR_CR12_GPUSV;
  maskRdy = PWR_CR12_VDDGPURDY;

