zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
  /*request monitoring of supply*/
  (void)HAL_PWREx_EnableGPUSupplyMonitoring();


  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until GPU regulator ready flag is set */
  while ((PWR->CR12 & maskRdy) != maskRdy)
  {
    if ((HAL_GetTick() - tickstart) > PWREx_FLAG_SETTING_DELAY_US)
    {
      return HAL_TIMEOUT;
    }
  }

  /* remove supply isolation  */
  SET_BIT(PWR->CR12, maskEn);
  return HAL_OK;
}

/**
  * @brief  GPU supply not present.
  * @retval HAL status
  */
void HAL_PWREx_DisableGPUSupply(void)
{
  /* set supply isolation  */
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPUSV);

  /*remove supply monitoring*/
  HAL_PWREx_DisableGPUSupplyMonitoring();
}


/**
  * @brief  Enable monitoring on GPU supply.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PWREx_EnableGPUSupplyMonitoring(void)
{
  SET_BIT(PWR->CR12, PWR_CR12_GPUVMEN);
  return HAL_OK;
}

/**
  * @brief  Disable monitoring on GPU supply.
  * @retval HAL status
  */
void HAL_PWREx_DisableGPUSupplyMonitoring(void)
{
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPUVMEN);
}

/**
  * @brief  Enable low monitoring threshold.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_PWREx_EnableGPULowThreshold(void)
{
  SET_BIT(PWR->CR12, PWR_CR12_GPULVTEN);
  return HAL_OK;
}

/**
  * @brief  Disable low monitoring threshold.
  * @retval HAL status
  */
void HAL_PWREx_DisableGPULowThreshold(void)
{
  CLEAR_BIT(PWR->CR12, PWR_CR12_GPULVTEN);
}

/**
  * @brief  Indicate whether the VDDgpu voltage level is above or below the threshold.
  * @retval VDDgpu level.
  */
uint32_t HAL_PWREx_GetVDDgpuRange(void)
{
  uint32_t regValue = PWR->CR12;
  uint32_t result;   /* PWR_NO_VDDGPU_MEASUREMENT_AVAILABLE */

  /* check VDDgpu monitoring is ON */
  if ((regValue & PWR_CR12_GPUVMEN) != PWR_CR12_GPUVMEN)
  {
    result   =  PWR_NO_VDDGPU_MEASUREMENT_AVAILABLE;
  }

  /* Compare the read value to the VDDCPU threshold */
  else if ((regValue & PWR_CR12_VDDGPURDY) == PWR_CR12_VDDGPURDY)
  {
    result   = ((PWR->CR12 & PWR_CR12_GPULVTEN) == PWR_CR12_GPULVTEN) ? PWR_VDDGPU_ABOVE_EQUAL_LOW_THRESHOLD : \
               PWR_VDDGPU_ABOVE_EQUAL_HIGH_THRESHOLD;
  }
  else
  {
    result   = ((PWR->CR12 & PWR_CR12_GPULVTEN) == PWR_CR12_GPULVTEN) ? PWR_VDDGPU_BELOW_LOW_THRESHOLD : \
               PWR_VDDGPU_BELOW_HIGH_THRESHOLD;
  }
  return result;
}
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
#endif /* defined(PWR_CR12_VDDGPURDY) */

#if defined(CORE_CM33)||defined(CORE_CA35)
/*CPU3 cannot Write into CR2 register (but READ possible)*/
/**
  * @brief  Enable the VBAT and temperature monitoring.
  * @note   After reset PWR_CR2/PWR_CR9/PWR_CR10 registers are write-protected,
  * @note   see HAL_PWR_EnableBkUpD3Access/HAL_PWR_DisableBkUpD3Access
  * @note   As this function accesses  to one of these registers, user shall check write protection is removed
  * @note   before calling this function (e.g. call to HAL_PWR_EnableBkUpD3Access during start of user application)
  * @retval HAL status
  */
void HAL_PWREx_EnableVbatTempMonitoring(void)
{

  /* Enable the VBAT and Temperature monitoring */
  SET_BIT(PWR->CR2, PWR_CR2_MONEN);
}

/**
  * @brief  Disable the VBAT and temperature monitoring.
  * @note   After reset PWR_CR2/PWR_CR9/PWR_CR10 registers are write-protected,
  * @note   see HAL_PWR_EnableBkUpD3Access/HAL_PWR_DisableBkUpD3Access
  * @note   As this function accesses  to one of these registers, user shall check write protection is removed
  * @note   before calling this function (e.g. call to HAL_PWR_EnableBkUpD3Access during start of user application)
  * @retval HAL status
  */
void HAL_PWREx_DisableVbatTempMonitoring(void)
{
  /* Disable the VBAT and Temperature monitoring */
  CLEAR_BIT(PWR->CR2, PWR_CR2_MONEN);
}
#endif /* defined(CORE_CM33)||defined(CORE_CA35)*/


/**
  * @brief  Indicate whether the junction temperature is between, above or below the threshold.
  * @retval Temperature level.
  */
uint32_t HAL_PWREx_GetTemperatureLevel(void)
{
  uint32_t regValue = PWR->CR2;
  uint32_t result   = PWR_NO_TEMP_MEASUREMENT_AVAILABLE;

  /* Check VBAT/TEMP monitoring is ON */
  if ((regValue & PWR_CR2_MONEN) != PWR_CR2_MONEN)
  {
    result = PWR_NO_TEMP_MEASUREMENT_AVAILABLE;
  }

  /* Compare the read value to the temperature threshold */
  else if (((regValue & PWR_CR2_TEMPH) != PWR_CR2_TEMPH) && ((regValue & PWR_CR2_TEMPL) != PWR_CR2_TEMPL))
  {
    result = PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR2_TEMPL) == PWR_CR2_TEMPL)
  {
    result = PWR_TEMP_BELOW_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR2_TEMPH) == PWR_CR2_TEMPH)
  {
    result = PWR_TEMP_ABOVE_HIGH_THRESHOLD;
  }
  else {}

  return result;
}


/**
  * @brief  Indicate whether the Battery voltage level is between, above or below the threshold.
  * @retval VBAT level.
  */

uint32_t HAL_PWREx_GetVbatLevel(void)
{
  uint32_t regValue = PWR->CR2;
  uint32_t result   = PWR_NO_VBAT_MEASUREMENT_AVAILABLE;

  /* check VBAT/TEMP monitoring is ON */
  if ((regValue & PWR_CR2_MONEN) != PWR_CR2_MONEN)
  {
    result   =  PWR_NO_VBAT_MEASUREMENT_AVAILABLE;
  }

  /* Compare the read value to the Vbat threshold */
  else if (((regValue & PWR_CR2_VBATH) != PWR_CR2_VBATH) && ((regValue & PWR_CR2_VBATL) != PWR_CR2_VBATL))
  {
    result   =  PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR2_VBATL) == PWR_CR2_VBATL)
  {
    result   =  PWR_VBAT_BELOW_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR2_VBATH) == PWR_CR2_VBATH)
  {
    result   =  PWR_VBAT_ABOVE_HIGH_THRESHOLD;
  }
  else {}

  return result;
}


/**
  * @brief  This function handles the PWR VBAT/TEMPERATURE TAMPER interrupt request.
  * @note   This API should be called under the TAMPER_IRQHandler().
  * @retval None
  */
void HAL_PWREx_TEMP_VBAT_IRQHandler(void)
{
  uint32_t value;

  value = HAL_PWREx_GetVbatLevel();
  switch (value)
  {
    case PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD :
      HAL_PWREx_VBAT_INRANGECallback();
      break;
    case PWR_VBAT_BELOW_LOW_THRESHOLD :
      HAL_PWREx_VBAT_LowerCallback();
      break;
    case PWR_VBAT_ABOVE_HIGH_THRESHOLD :
      HAL_PWREx_VBAT_HIGHERCallback();
      break;
    default :
      break;
  }

