zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
  value = HAL_PWREx_GetTemperatureLevel();
  switch (value)
  {
    case PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD :
      HAL_PWREx_TEMP_INRANGECallback();
      break;
    case PWR_TEMP_BELOW_LOW_THRESHOLD :
      HAL_PWREx_TEMP_LowerCallback();
      break;
    case PWR_TEMP_ABOVE_HIGH_THRESHOLD :
      HAL_PWREx_TEMP_HIGHERCallback();
      break;
    default :
      break;
  }
}

/**
  * @brief  PWR VBAT interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_VBAT_HIGHERCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VBAT_HIGHERCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_VBAT_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VBAT_LowerCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_VBAT_INRANGECallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWR_BAT_TAMPER_INRANGECallback could be implemented in the user file
   */
}


/**
  * @brief  PWR TEMP interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_TEMP_HIGHERCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_TEMP_HIGHERCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_TEMP_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_TEMP_LowerCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_TEMP_INRANGECallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_TEMP_INRANGECallback could be implemented in the user file
   */
}


#if defined (PWR_CR6_VCPUMONEN)

/* Power VDDcpu detection functions */

/**
  * @brief  Configure the VDDcpu threshold detection.
  * @param  sConfigVDDcpuD: pointer to an PWREx_DetectionTypeDef structure that contains the configuration
  *                     information for the VDDcpu detection.
  * @note   Refer to the electrical characteristics of your device datasheet for more details
  *         about the voltage threshold corresponding to each detection level.
  * @note   choice is to use EXTI interruption for notification and not a tamper event
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_ConfigVDDcpuD(const PWREx_DetectionTypeDef *sConfigVDDcpuD)
{
  /* Check the parameters */
  assert_param(IS_PWR_VDDCPUD_LEVEL(sConfigVDDcpuD->Level));
  assert_param(IS_PWR_VDDCPUD_MODE(sConfigVDDcpuD->Mode));

  /* update the VCPULLS bit according to Level value */
  MODIFY_REG(PWR->CR6, PWR_CR6_VCPUH, sConfigVDDcpuD->Level);


  /* Clear any previous config. Keep it clear if no IT mode is selected */
  __HAL_PWR_VDDCPUD_EXTI_DISABLE_IT();
  __HAL_PWR_VDDCPUD_EXTI_DISABLE_RISING_FALLING_EDGE();


  /* Configure the interrupt mode */
  if (IS_AN_INTERRUPT_PWR_VDDCPUD_MODE(sConfigVDDcpuD->Mode))
  {
    __HAL_PWR_VDDCPUD_EXTI_ENABLE_IT();
  }

  /* Configure the edge */
  if ((sConfigVDDcpuD->Mode) == PWR_VDDCPUD_MODE_IT_RISING)
  {
    __HAL_PWR_VDDCPUD_EXTI_ENABLE_RISING_EDGE();
  }

  if ((sConfigVDDcpuD->Mode) == PWR_VDDCPUD_MODE_IT_FALLING)
  {
    __HAL_PWR_VDDCPUD_EXTI_ENABLE_FALLING_EDGE();
  }

  if ((sConfigVDDcpuD->Mode) == PWR_VDDCPUD_MODE_IT_RISING_FALLING)
  {
    __HAL_PWR_VDDCPUD_EXTI_ENABLE_RISING_FALLING_EDGE();
  }
}

/**
  * @brief  Enable the VDDcpu Detector.
  * @retval None
  */
void HAL_PWREx_EnableVDDcpuD(void)
{
  SET_BIT(PWR->CR6, PWR_CR6_VCPUMONEN);
}

/**
  * @brief  disable the VDDcpu Detector.
  * @retval None
  */
void HAL_PWREx_DisableVDDcpuD(void)
{
  CLEAR_BIT(PWR->CR6, PWR_CR6_VCPUMONEN);
}
#endif /*defined(CORE_CM33)||defined(CORE_CA35) */
/**
  * @brief  Indicate whether the VDDcpu voltage level is between, above or below the threshold.
  * @retval VDDcpu level.
  */
uint32_t HAL_PWREx_GetVDDcpuRange(void)
{
  uint32_t regValue = PWR->CR6;
  uint32_t result   = PWR_NO_VDDCPU_MEASUREMENT_AVAILABLE;

  /* check VDDcpu monitoring is ON */
  if ((regValue & PWR_CR6_VCPUMONEN) != PWR_CR6_VCPUMONEN)
  {
    result   =  PWR_NO_VDDCPU_MEASUREMENT_AVAILABLE;
  }

  /* Compare the read value to the VDDCPU threshold */
  else if (((regValue & PWR_CR6_VCPUH) != PWR_CR6_VCPUH) && ((regValue & PWR_CR6_VCPUL) != PWR_CR6_VCPUL))
  {
    result   =  PWR_VDDCPU_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR6_VCPUL) == PWR_CR6_VCPUL)
  {
    result   =  PWR_VDDCPU_BELOW_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR6_VCPUH) == PWR_CR6_VCPUH)
  {
    result   =  PWR_VDDCPU_ABOVE_HIGH_THRESHOLD;
  }
  else {}

  return result;
}

/**
  * @brief  This function handles the PWR VDDcpu interrupt request.
  * @brief  This API should be called under HAL_EXTI_Handler() when line VDDcpu trigg
  * @retval None
  */
void HAL_PWREx_VDDcpuD_IRQHandler(void)
{
  uint32_t value;

  value = HAL_PWREx_GetVDDcpuRange();
  switch (value)
  {
    case PWR_VDDCPU_BETWEEN_HIGH_LOW_THRESHOLD :
      HAL_PWREx_VDDcpuD_INRANGECallback();
      break;
    case PWR_VDDCPU_BELOW_LOW_THRESHOLD :
      HAL_PWREx_VDDcpuD_LowerCallback();
      break;
    case PWR_VDDCPU_ABOVE_HIGH_THRESHOLD :
      HAL_PWREx_VDDcpuD_HIGHERCallback();
      break;
    default :
      break;
  }

  /* Clear PWR VDDcpuD EXTI pending bit */
  __HAL_PWR_VDDCPUD_EXTI_CLEAR_FLAG();
}

/**
  * @brief  PWR VDDcpuD interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_VDDcpuD_HIGHERCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcpuD_HIGHERCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_VDDcpuD_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcpuD_LowerCallback could be implemented in the user file
   */
}

__weak void HAL_PWREx_VDDcpuD_INRANGECallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcpuD_INRANGECallback could be implemented in the user file
   */
}

#endif /* PWR_CR6_VCPUMONEN */


/* Power VDDcore detection functions */
#if defined (PWR_CR5_VCOREMONEN)
/**
  * @brief  Configure the VDDcore threshold detection
  * @param  sConfigVDDcoreD: pointer to an PWREx_DetectionTypeDef structure that contains the configuration
  *                     information for the VDDcore detection.
  * @note   Refer to the electrical characteristics of your device datasheet for more details
  *         about the voltage threshold corresponding to each detection level.
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_ConfigVDDcoreD(const PWREx_DetectionTypeDef *sConfigVDDcoreD)
{
  /* Check the parameters, no level threshold parameter for VDDcore */
  assert_param(IS_PWR_VDDCORED_MODE(sConfigVDDcoreD->Mode));

