zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
  /* Clear any previous config. Keep it clear if no IT mode is selected */
  __HAL_PWR_VDDCORED_EXTI_DISABLE_IT();
  __HAL_PWR_VDDCORED_EXTI_DISABLE_RISING_FALLING_EDGE();

  /* Configure the interrupt mode */
  if (IS_AN_INTERRUPT_PWR_VDDCORED_MODE(sConfigVDDcoreD->Mode))
  {
    __HAL_PWR_VDDCORED_EXTI_ENABLE_IT();
  }

  /* Configure the edge */
  if ((sConfigVDDcoreD->Mode) == PWR_VDDCORED_MODE_IT_RISING)
  {
    __HAL_PWR_VDDCORED_EXTI_ENABLE_RISING_EDGE();
  }

  if ((sConfigVDDcoreD->Mode) == PWR_VDDCORED_MODE_IT_FALLING)
  {
    __HAL_PWR_VDDCORED_EXTI_ENABLE_FALLING_EDGE();
  }

  if ((sConfigVDDcoreD->Mode) == PWR_VDDCORED_MODE_IT_RISING_FALLING)
  {
    __HAL_PWR_VDDCORED_EXTI_ENABLE_RISING_FALLING_EDGE();
  }
}

/**
  * @brief  Enable the VDDcore Detector.
  * @retval None
  */
void HAL_PWREx_EnableVDDcoreD(void)
{
  SET_BIT(PWR->CR5, PWR_CR5_VCOREMONEN);
}

/**
  * @brief  Disable the VDDcore Detector.
  * @retval None
  */
void HAL_PWREx_DisableVDDcoreD(void)
{
  CLEAR_BIT(PWR->CR5, PWR_CR5_VCOREMONEN);
}
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/
/**
  * @brief  Indicate whether the VDDcore voltage level is between, above or below the threshold.
  * @retval VDDcore level.
  */
uint32_t HAL_PWREx_GetVDDcoreRange(void)
{
  uint32_t regValue = PWR->CR5;
  uint32_t result   = PWR_NO_TEMP_MEASUREMENT_AVAILABLE;

  /* check VDDcore monitoring is ON */
  if ((regValue & PWR_CR5_VCOREMONEN) != PWR_CR5_VCOREMONEN)
  {
    result   =  PWR_NO_VDDCORE_MEASUREMENT_AVAILABLE;
  }

  /* Compare the read value to the VDDCORE threshold */
  else if (((regValue & PWR_CR5_VCOREH) != PWR_CR5_VCOREH) && ((regValue & PWR_CR5_VCOREL) != PWR_CR5_VCOREL))
  {
    result   =  PWR_VDDCORE_BETWEEN_HIGH_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR5_VCOREL) == PWR_CR5_VCOREL)
  {
    result   =  PWR_VDDCORE_BELOW_LOW_THRESHOLD;
  }

  else if ((regValue & PWR_CR5_VCOREH) == PWR_CR5_VCOREH)
  {
    result   =  PWR_VDDCORE_ABOVE_HIGH_THRESHOLD;
  }
  else {}

  return result;
}

/**

  * @brief  This function handles the PWR VDDcore interrupt request.
  * @brief  This API should be called under HAL_EXTI_Handler() when line VDDcore trigg
  * @retval None
  */
void HAL_PWREx_VDDcoreD_IRQHandler(void)
{
  uint32_t value;

  value = HAL_PWREx_GetVDDcoreRange();
  switch (value)
  {
    case PWR_VDDCORE_BETWEEN_HIGH_LOW_THRESHOLD :
      HAL_PWREx_VDDcoreD_INRANGECallback();
      break;
    case PWR_VDDCORE_BELOW_LOW_THRESHOLD :
      HAL_PWREx_VDDcoreD_LowerCallback();
      break;
    case PWR_VDDCORE_ABOVE_HIGH_THRESHOLD :
      HAL_PWREx_VDDcoreD_HIGHERCallback();
      break;
    default :
      break;
  }

  /* Clear PWR VDDcoreD EXTI pending bit */
  __HAL_PWR_VDDCORED_EXTI_CLEAR_FLAG();
}

/**
  * @brief  PWR VDDcoreD interrupt callback
  * @retval None
  */
__weak void HAL_PWREx_VDDcoreD_HIGHERCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcoreD_HIGHERCallback could be implemented in the user file
   */
}
__weak void HAL_PWREx_VDDcoreD_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcoreD_LowerCallback could be implemented in the user file
   */
}

__weak void HAL_PWREx_VDDcoreD_INRANGECallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_VDDcoreD_INRANGECallback could be implemented in the user file
   */
}

#endif /* PWR_CR5_VCOREMONEN */


#if defined(CORE_CM33)||defined(CORE_CA35)

void pvmPosition(uint32_t periph, __IO uint32_t **regPtr, pvmPosTypeDef *pvmPos)
{
  assert_param(IS_PWR_PVM_PERIPH(periph));

  switch (periph)
  {
    case PWR_PVM_VDDIO1 :
      *regPtr = &PWR->CR8;
      pvmPos->active      = PWR_CR8_VDDIO1SV_Pos;
      pvmPos->ready      = PWR_CR8_VDDIO1RDY_Pos;
      pvmPos->monitor    = PWR_CR8_VDDIO1VMEN_Pos;
      pvmPos->low        = PWR_CR8_VDDIO1VRSEL_Pos;
      pvmPos->lowStandby = PWR_CR8_VDDIO1VRSTBY_Pos;
      break;
    case PWR_PVM_VDDIO2 :
      *regPtr = &PWR->CR7;
      pvmPos->active      = PWR_CR7_VDDIO2SV_Pos;
      pvmPos->ready      = PWR_CR7_VDDIO2RDY_Pos;
      pvmPos->monitor    = PWR_CR7_VDDIO2VMEN_Pos;
      pvmPos->low        = PWR_CR7_VDDIO2VRSEL_Pos;
      pvmPos->lowStandby = PWR_CR7_VDDIO2VRSTBY_Pos;
      break;
    case PWR_PVM_VDDIO3 :
      *regPtr = &PWR->CR1;
      pvmPos->active   = PWR_CR1_VDDIO3SV_Pos;
      pvmPos->ready   = PWR_CR1_VDDIO3RDY_Pos;
      pvmPos->monitor = PWR_CR1_VDDIO3VMEN_Pos;
      break;
#if defined(PWR_CR1_VDDIO4SV)
    case PWR_PVM_VDDIO4 :
      *regPtr = &PWR->CR1;
      pvmPos->active   = PWR_CR1_VDDIO4SV_Pos;
      pvmPos->ready   = PWR_CR1_VDDIO4RDY_Pos;
      pvmPos->monitor = PWR_CR1_VDDIO4VMEN_Pos;
      break;
#endif /* PWR_CR1_VDDIO4SV */
#if defined(PWR_CR1_USB33SV)
    case PWR_PVM_USB33 :
      *regPtr = &PWR->CR1;
      pvmPos->active   = PWR_CR1_USB33SV_Pos;
      pvmPos->ready   = PWR_CR1_USB33RDY_Pos;
      pvmPos->monitor = PWR_CR1_USB33VMEN_Pos;
      break;
#endif /* PWR_CR1_USB33SV */
#if defined(PWR_CR1_UCPDSV)
    case PWR_PVM_UCPD :
      *regPtr = &PWR->CR1;
      pvmPos->active   = PWR_CR1_UCPDSV_Pos;
      pvmPos->ready   = PWR_CR1_UCPDRDY_Pos;
      pvmPos->monitor = PWR_CR1_UCPDVMEN_Pos;
      break;
#endif /* PWR_CR1_UCPDSV */
    case PWR_PVM_A :
      *regPtr = &PWR->CR1;
      pvmPos->active   = PWR_CR1_ASV_Pos;
      pvmPos->ready   = PWR_CR1_ARDY_Pos;
      pvmPos->monitor = PWR_CR1_AVMEN_Pos;
      break;
    default :
      *regPtr = NULL;
      break;
  }
}


/**
  * @brief  Configure a periph voltage  monitoring(PVM).
  * @param  mode: indicates if an interruption is raised when PVM status changes.
  *          This parameter can be one of the following values:
  *            @arg PWR_PVM_MODE_NORMAL                              no interruption
  *            @arg PWR_PVM_MODE_IT_RISING                           interruption when all PVM periph voltage become
                                                                     equals or higher than PVM threshold
  *            @arg PWR_PVM_MODE_IT_FALLING                          interruption when at least one  PVM periph voltage
                                                                     become lower  than PVM threshold
  *            @arg PWR_PVM_MODE_IT_RISING_FALLING                   combined cases
  * @note   Voltage threshold is 1.6 volt whatever periph is.
  * @retval None
  */
void HAL_PWREx_ConfigurePVM(uint32_t mode)
{
  assert_param(IS_PWR_PVM_MODE(mode));

