zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
  /* Clear any previous config. Keep it clear if no IT mode is selected */
  __HAL_PWR_PVM_EXTI_DISABLE_IT();
  __HAL_PWR_PVM_EXTI_DISABLE_RISING_FALLING_EDGE();

  /* Configure interrupt mode */
  if (IS_AN_INTERRUPT_PWR_PVM_MODE(mode))
  {
    __HAL_PWR_PVM_EXTI_ENABLE_IT();
  }

  /* Configure the edge */
  if ((mode) == PWR_PVM_MODE_IT_RISING)
  {
    __HAL_PWR_PVM_EXTI_ENABLE_RISING_EDGE();
  }

  if ((mode) == PWR_PVM_MODE_IT_FALLING)
  {
    __HAL_PWR_PVM_EXTI_ENABLE_FALLING_EDGE();
  }

  if ((mode) == PWR_PVM_MODE_IT_RISING_FALLING)
  {
    __HAL_PWR_PVM_EXTI_ENABLE_RISING_FALLING_EDGE();
  }
}

/**
  * @brief  Set  voltage  for VDDIO1/2.
  * @param  periph (single), should be IO1 or IO2
  * @param  setLow if true low voltage is requested (1.8) else high voltage (3.3, default)
  *                @arg need to paas the address of uint32_t type variable
  * @param  setLowStandby  if true low voltage is requested (1.8) in standby and standby exit else high voltage
  *                        (3.3, default)
  *                        @arg need to paas the address of uint32_t type variable
  * @retval None
  */
void HAL_PWREx_Set_IO_Voltage(uint32_t periph, uint32_t setLow, uint32_t setLowStandby)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos;

  assert_param(IS_PWR_CONFIGURABLE_IO(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  (setLow != 0U)        ? (SET_BIT(*regPtr, 1UL << (pvmPos.low)))        : (CLEAR_BIT(*regPtr, 1UL << (pvmPos.low)));
  (setLowStandby != 0U) ? (SET_BIT(*regPtr, 1UL << (pvmPos.lowStandby))) : \
  (CLEAR_BIT(*regPtr, 1UL << (pvmPos.lowStandby)));
}

/**
  * @brief  Get  voltage  for VDDIO1/2.
  * @param  periph (single), should be IO1 or IO2
  * @param  isLow  true if low voltage is set  (1.8) else high voltage (3.3, default)
  *                @arg need to paas the address of uint32_t type variable
  * @param  isLowStandby true low voltage is set (1.8) in standby and standby exit else high voltage (3.3, default)
  *                      @arg need to paas the address of uint32_t type variable
  * @retval None
  */
void HAL_PWREx_Get_IO_Voltage(uint32_t periph, uint32_t *isLow, uint32_t *isLowStandby)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos;

  assert_param(IS_PWR_CONFIGURABLE_IO(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  *isLow        = (READ_BIT(*regPtr, 1UL << (pvmPos.low))        != 0U) ? 1U : 0U;
  *isLowStandby = (READ_BIT(*regPtr, 1UL << (pvmPos.lowStandby)) != 0U) ? 1U : 0U;
}

/**
  * @brief  Validate a Peripheral Supply Voltage (PVS)
  * @note   Before using a  peripheral, its supply shall be validated (remove electrical and logical isolation)
  * @param  periph (single), for all PVM periph value, see  macro IS_PWR_PVM_PERIPH
  * @retval None
  */
HAL_StatusTypeDef HAL_PWREx_EnableSupply(uint32_t periph)
{
  __IO uint32_t *regPtr;
  uint32_t tickstart;
  uint32_t mskRdy;
  pvmPosTypeDef pvmPos = {0, 0, 0, 0, 0};

  assert_param(IS_PWR_PVM_PERIPH(periph));

  /*set supply monitoring*/
  HAL_PWREx_EnableSupplyMonitoring(periph);

  /* Wait until regulator ready flag is set */
  pvmPosition(periph, &regPtr, &pvmPos);
  mskRdy = 1UL << pvmPos.ready ;
  tickstart = HAL_GetTick();

  while ((*regPtr & mskRdy) != mskRdy)
  {
    if ((HAL_GetTick() - tickstart) > PWREx_FLAG_SETTING_DELAY_US)
    {
      return HAL_TIMEOUT;
    }
  }

  /* remove isolation */
  SET_BIT(*regPtr, (1UL << (pvmPos.active)));
  return HAL_OK;
}


/**
  * @brief  invalidate a Peripheral Supply Voltage (PVS)
  * @note   After  using a PVM peripheral, its supply shall be de-validated (set electrical and logical isolation)
  * @param  periph (single), for all PVM periph value, see  macro IS_PWR_PVM_PERIPH
  * @retval None
  */
void HAL_PWREx_DisableSupply(uint32_t periph)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos = {0, 0, 0, 0, 0};

  assert_param(IS_PWR_PVM_PERIPH(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  /*set supply isolation */
  CLEAR_BIT(*regPtr, 1U << (pvmPos.active));
  /*remove supply monitoring*/
  HAL_PWREx_EnableSupplyMonitoring(periph);
}


/**
  * @brief  Enable a Peripheral Supply Monitoring (PVM)
  * @note   For a peripheral, enable monitoring of its power suply
  * @param  periph (single), for all PVM periph value, see  macro IS_PWR_PVM_PERIPH
  * @retval None
  */
void HAL_PWREx_EnableSupplyMonitoring(uint32_t periph)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos = {0, 0, 0, 0, 0};

  assert_param(IS_PWR_PVM_PERIPH(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  SET_BIT(*regPtr, 1UL << (pvmPos.monitor));
}


/**
  * @brief  Disable a Peripheral Supply Monitoring (PVM)
  * @note   For a peripheral, enable monitoring of its power suply
  * @param  periph (single), for all PVM periph value, see  macro IS_PWR_PVM_PERIPH
  * @retval None
  */
void HAL_PWREx_DisableSupplyMonitoring(uint32_t periph)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos = {0, 0, 0, 0, 0};

  assert_param(IS_PWR_PVM_PERIPH(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  CLEAR_BIT(*regPtr, 1U << (pvmPos.monitor));
}


/**
  * @brief  return TRUE (not zero) if supply value for a peripheral is below PVM threshold
  * @param  periph (single), for all PVM periph value, see  macro IS_PWR_PVM_PERIPH
  * @note   Voltage threshold is 1.6 volt whatever periph is.
  * @retval return 0 if periph voltage is equal or  higher to PVM threshold
  */
uint32_t HAL_PWREx_PVM_IsBelowThreshold(uint32_t periph)
{
  __IO uint32_t *regPtr;
  pvmPosTypeDef pvmPos = {0, 0, 0, 0, 0};

  assert_param(IS_PWR_PVM_PERIPH(periph));
  pvmPosition(periph, &regPtr, &pvmPos);
  /*return true if Ready bit not set*/
  return (((*regPtr & (1UL << (pvmPos.ready))) != (1UL << (pvmPos.ready))) ? 1UL : 0UL) ;
}


/**
  * @brief  This function handles the PWR PVM interrupt request.
  * @note   This API should be called under the PVM_IRQHandler().
  * @retval None
  */
void HAL_PWREx_PVM_IRQHandler(void)
{
  if (((EXTI1->FPR1 & PWR_EXTI_LINE_PVM) == PWR_EXTI_LINE_PVM))
    /*interruption on falling  edge, thus one (or several) supply is lower than PVM threshold*/
  {
    HAL_PWREx_PVM_LowerCallback();
  }

