zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_pwr_ex.c
  if (((EXTI1->RPR1 & PWR_EXTI_LINE_PVM) == PWR_EXTI_LINE_PVM))
  {
    /*interruption on rising  edge, thus all supplies are equal or greater under PVM threshold*/
    HAL_PWREx_PVM_EqualHigherCallback();
  }
  /* Clear PWR PVD EXTI pending bit */
  __HAL_PWR_PVM_EXTI_CLEAR_FLAG();
}

/**
  *@brief PWR PVM rising interruption callback
  *@note  This function is called if :
           -PVM interruption on rising edge has been requested
           -one (or several)  monitored PVM periph power supply  becomes lower than PVM threshold
  *@note  If needed, it is under user responsibility to handle level of each PVM periph  thru state variables.
       HAL_PWREx_PVM_LowerCallback and HAL_PWREx_PVM_EqualHigherCallback  callback enable such processing.
  *@retval None
  */
__weak void HAL_PWREx_PVM_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_PVM_LowerCallback could be implemented in the user file */
}

/**
  *@brief PWR PVM falling interruption callback
  *@note  This function is called if :
           -PVM interruption on falling edge has been requested
           -power supply of one (or several) monitored PVM periph becomes greater or equal  than PVM threshold
           and power supply for all other monitored PVM peripherals is also greater or equal  than PVM threshold
  *@note  If needed, it is under user responsibility to handle level of each PVM periph  thru state variables.
       HAL_PWREx_PVM_LowerCallback and HAL_PWREx_PVM_EqualHigherCallback  callback enable such processing.
  *@retval None
  */
__weak void HAL_PWREx_PVM_EqualHigherCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_PVM_EqualHigherCallback could be implemented in the user file */
}

#if defined(PWR_CR12_VDDGPURDY)
/**
  * @brief  This function handles the PWR_VDDGPU_VD interrupt request.
  * @note   This API should be called under the VDDGPU_VD_IRQHandler().
  * @retval None
  */
void HAL_PWREx_GPU_IRQHandler(void)
{
  if (((PWR->CR12) & PWR_CR12_VDDGPURDY) != PWR_CR12_VDDGPURDY)
  {
    HAL_PWREx_GPU_LowerCallback();
  }
  else
  {
    HAL_PWREx_GPU_EqualHigherCallback();
  }
  /* Clear PWR GPU EXTI pending bit */
  __HAL_PWR_VDDGPUD_EXTI_CLEAR_FLAG();
}

/**
  *@brief PWR GPU rising interruption callback
  *@retval None
  */
__weak void HAL_PWREx_GPU_LowerCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_GPU_LowerCallback could be implemented in the user file */
}

/**
  *@brief PWR GPU falling interruption callback
  *@retval None
  */
__weak void HAL_PWREx_GPU_EqualHigherCallback(void)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_GPU_EqualHigherCallback could be implemented in the user file */
}
#endif /* defined(PWR_CR12_VDDGPURDY) */
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/

/**
  * @brief  PWR WKUP interrupt callback
  * @note   In case of M0+ wakeup from tamper, Callback shall manage wakeup tamper event
  *         (which one has triggered, clear operation, ..)
  *         Not managed  at PWR level as power module.
  * @param  line wakeup line number (only case M33 or A35 wakeup)
  * @retval None
  */
#if defined(CORE_CM33)||defined(CORE_CA35)
__weak void HAL_PWREx_WKUP_Callback(__attribute__((unused))uint16_t line)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_PWREx_WKUP1Callback could be implemented in the user file
  */
}
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/


#if !defined(CORE_CM0PLUS)
/**
  * @brief  This function handles the PWR wakeup (or external TAMPER) detection  interruption
  * Parse all wakeup lines in order to find out which one has detected on wakeup event
  * then calls associated callback.
  * @note   This API should be called under the CPUx_WAKEUP_PIN_IRQn.
  * @retval None
  */
void HAL_PWREx_WAKEUP_PIN_IRQHandler(void)
{
#define WKUPCR_ADD_OFFSET      0x01u

  /* Wakeup event  for current CPU detected on a (or several) PWR line(s), line shall be identified,
     associated flag cleared and callback invoked */
  __IO uint32_t *regaddr;

  for (uint16_t index = PWR_WAKEUP_PIN_ID1; index <= PWR_WAKEUP_PIN_ID6; index++)
  {
    /* Selected register corresponding to input wakeup line*/
    regaddr = &PWR->WKUPCR1 + (WKUPCR_ADD_OFFSET * index);
    if (READ_BIT(*regaddr, PWR_WKUPCR1_WKUPF) != (uint32_t)RESET)
    {
      /* Clear PWR WKUPF#i flag */
      SET_BIT(*regaddr, PWR_WKUPCR1_WKUPC);
      /* PWR WKUP#i interrupt user callback */
      HAL_PWREx_WKUP_Callback(index);
    }
  }
}
#endif /*!defined(CORE_CM0PLUS)*/


/**
  * @brief Enters MPU  CSTOP allowing system stop but denying system standby
  * @param Regulator: Specifies which power state regulator supplying current CPU domain can reach
  *            This parameter can be one of the following values:
  *            @arg PWR_REGULATOR_LP_OFF i.e. full power
  *            @arg PWR_REGULATOR_LP_ON_LV_OFF i.e. can be low power but nominal voltage
  *            @arg PWR_REGULATOR_LP_ON_LV_ON  i.e. can be low power and  low voltage
  * @param STOPEntry: Specifies if Stop mode in entered with WFI or WFE instruction.
  *          This parameter can be one of the following values:
  *            @arg PWR_STOPENTRY_WFI: Enter Stop mode with WFI instruction
  *            @arg PWR_STOPENTRY_WFE: Enter Stop mode with WFE instruction
  * @retval None
  */
void HAL_PWREx_EnterCSTOPAllowSTOP(uint32_t Regulator, uint8_t STOPEntry)
{
  HAL_PWR_EnterSTOPMode(Regulator, STOPEntry);
}


#if defined(CORE_CM33)||defined(CORE_CA35)
/**
  * @brief Enters MPU  CSTOP allowing system Standby mode (1 or 2 see param)
  * @param STANDBYType: Specifies standby mode that can be reached
  *            This parameter can be one of the following values:
  *            @arg PWR_STANDBY_1 i.e. D3 still open (but D1 and D2 OFF)
  *            @arg PWR_STANDBY_2 i.e. D3 and D2 and D1 OFF
  * @retval None
  */
void HAL_PWREx_EnterCSTOPAllowSTANDBY(uint8_t STANDBYType)
{
  HAL_PWR_EnterSTANDBYMode(STANDBYType);
}
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */


/**
  * @brief  This function clear all status flag set by PWR IP
  * @note   before entering standby user shall call this function other flag may not be relevant
  * @retval None
  */
void HAL_PWREx_ClearStatusFlag(void)
{
#if defined(CORE_CA35)
  CLEAR_BIT(PWR->CPU1CR, PWR_CPU1CR_CSSF);
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
  CLEAR_BIT(PWR->CPU2CR, PWR_CPU2CR_CSSF);
#endif /* CORE_CM33 */
#if defined(CORE_CM0PLUS)
  CLEAR_BIT(PWR->CPU3CR, PWR_CPU3CR_CSSF);
#endif /* CORE_CM0PLUS */
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_PWR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

